/*
 * @Author: xyZhan
 * @Date: 2026-01-31 19:13:44
 * @LastEditors: xyZhan
 * @LastEditTime: 2026-01-31 20:06:29
 * @FilePath: \textgame\src\data\questions.ts
 * @Description: 
 * 
 * Copyright (c) 2026 by , All Rights Reserved. 
 */
export interface Question {
  q: string;
  options: string[];
  answer: string;
}

export const questions: Question[] = [
  {
    "q": "“一剑轻安你倾尽天下，转身的手法如此潇洒”",
    "options": ["一剑轻安", "宿命", "烟笼长安", "红颜若雪"],
    "answer": "一剑轻安"
  },
  {
    "q": "“划地三尺只为转世灵魂换你的生辰”",
    "options": ["宿命", "以剑之名血薇", "临安记忆", "水墨江南"],
    "answer": "宿命"
  },
  {
    "q": "“三千红尘路，长安于我意何如？无关青云路，无关诗书，无你处，无江湖”",
    "options": ["烟笼长安", "清歌流觞", "宫心", "乱世"],
    "answer": "烟笼长安"
  },
  {
    "q": "“暮色尽，半醉半醒半浮生；暮色尽，一生一代一双人”",
    "options": ["红颜若雪", "江山如梦", "摆渡", "人间朝暮"],
    "answer": "红颜若雪"
  },
  {
    "q": "“以剑之名随你傲视苍生，看那年听雪楼上凤翔龙腾”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“还不如放手，浮生如梦；风情千万种，尘世与共”",
    "options": ["江山如梦", "临安记忆", "清歌流觞", "宫心"],
    "answer": "江山如梦"
  },
  {
    "q": "“谁在哼唱、古镇的过往，千百年风华已被淡忘”",
    "options": ["清歌流觞", "临安记忆", "水墨江南", "人间朝暮"],
    "answer": "清歌流觞"
  },
  {
    "q": "“说后宫佳丽，都机关算尽，算尽了心血，只为谋生谋情”",
    "options": ["宫心", "乱世", "摆渡", "鸿蒙传说"],
    "answer": "宫心"
  },
  {
    "q": "“摆渡红尘你牵了谁的手，而我独取一瓢只为你消瘦”",
    "options": ["摆渡", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "摆渡"
  },
  {
    "q": "“都道初心不曾负，而初心是何物，三千夜色我独歌，这万丈红尘无人和”",
    "options": ["人间朝暮", "烟笼长安", "临安记忆", "水墨江南"],
    "answer": "人间朝暮"
  },
  {
    "q": "“冰雪埋葬谁的伤痕，剑啸九天浮沉。笙歌漫舞丝竹声声，万人俯首称臣”",
    "options": ["红颜若雪", "以剑之名血薇", "乱世", "鸿蒙传说"],
    "answer": "红颜若雪"
  },
  {
    "q": "“我曾傲视群雄，也挥刀划破过苍穹，为谁征战天下，曾经豪情疏狂”",
    "options": ["风华燃尽指间砂", "一剑轻安", "乱世", "鸿蒙传说"],
    "answer": "风华燃尽指间砂"
  },
  {
    "q": "“一笔朱砂为你轻轻点。檐外轻风惊落一池桃花染，西窗姑娘灯下绣一段凄凉”",
    "options": ["临安记忆", "水墨江南", "清歌流觞", "宫心"],
    "answer": "临安记忆"
  },
  {
    "q": "“题诗长短句，句句都是你”",
    "options": ["水墨江南", "临安记忆", "烟笼长安", "人间朝暮"],
    "answer": "水墨江南"
  },
  {
    "q": "“冠冕堂皇地品味，或就此沉醉，看一世高贵，在一瞬间倾颓”",
    "options": ["魅影醉", "宫心", "乱世", "摆渡"],
    "answer": "魅影醉"
  },
  {
    "q": "“成王败寇的传闻，从未曾归尘古老歌谣，传唱挫骨扬灰的爱恨”",
    "options": ["鸿蒙传说", "乱世", "人间朝暮", "风华燃尽指间砂"],
    "answer": "鸿蒙传说"
  },
  {
    "q": "“剑出风流意断金，青锋飒沓如流星，这一战生死轮回可尽兴”",
    "options": ["乱世", "一剑轻安", "以剑之名血薇", "鸿蒙传说"],
    "answer": "乱世"
  },
  {
    "q": "“便以身代君领受长眠之命，虽未满百岁已如歌归于其居”",
    "options": ["千山雪寂", "宿命", "摆渡", "人间朝暮"],
    "answer": "千山雪寂"
  },
  {
    "q": "“灵渊片刻缱绻，印在你我心涧，流波一夜风雨，消散作云烟”",
    "options": ["素雪风华", "红颜若雪", "水墨江南", "临安记忆"],
    "answer": "素雪风华"
  },
  {
    "q": "“马蹄轻踏南朝已渐行渐远，散尽繁华转眼已变淡”",
    "options": ["临安记忆", "水墨江南", "清歌流觞", "宫心"],
    "answer": "临安记忆"
  },
  {
    "q": "“谁还为我效忠用一生相守坟墓旁，山脚下凝望，却更深邃了目光”",
    "options": ["风华燃尽指间砂", "一剑轻安", "乱世", "鸿蒙传说"],
    "answer": "风华燃尽指间砂"
  },
  {
    "q": "“我埋下沉默百代的红尘，往事清冷，便拥余温入梦”",
    "options": ["千山雪寂", "宿命", "摆渡", "人间朝暮"],
    "answer": "千山雪寂"
  },
  {
    "q": "“下一个万年后，仙凡妖圣谁是阶下囚，谁是座上尊”",
    "options": ["鸿蒙传说", "乱世", "人间朝暮", "风华燃尽指间砂"],
    "answer": "鸿蒙传说"
  },
  {
    "q": "“献身洗你嫌疑，成全完美救济，一无所知才是最深愿祈”",
    "options": ["案语", "宫心", "乱世", "摆渡"],
    "answer": "案语"
  },
  {
    "q": "“一念执迷为你烽火连城，换你心疼，斩不断，重来回首已三生”",
    "options": ["红颜若雪", "以剑之名血薇", "乱世", "鸿蒙传说"],
    "answer": "红颜若雪"
  },
  {
    "q": "“有人容光胜锦，有人婉转如莺，承欢于御前自有万种风情”",
    "options": ["宫心", "乱世", "摆渡", "鸿蒙传说"],
    "answer": "宫心"
  },
  {
    "q": "“余香幽、戏子坐桥头，昨日泛黄的一片绣，挑针引线把时光停留”",
    "options": ["清歌流觞", "临安记忆", "水墨江南", "人间朝暮"],
    "answer": "清歌流觞"
  },
  {
    "q": "“天如洗，重山深碧，雪月如银；水如镜，流萤竹间隐，明眸如星”",
    "options": ["故人归依旧", "临安记忆", "烟笼长安", "人间朝暮"],
    "answer": "故人归依旧"
  },
  {
    "q": "“掌线曲折刻画魔障，心若苍茫悲欢如浪，焚香在北邙，听风祝颂和梵唱”",
    "options": ["风华燃尽指间砂", "一剑轻安", "乱世", "鸿蒙传说"],
    "answer": "风华燃尽指间砂"
  },
  {
    "q": "“岁月不堪数，故人不知处，最是人间留不住”",
    "options": ["烟笼长安", "清歌流觞", "宫心", "乱世"],
    "answer": "烟笼长安"
  },
  {
    "q": "“浮舟相随：京洛雪浅，阡陌千灯，恍然一梦，长歌命中”",
    "options": ["秦时明月", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "秦时明月"
  },
  {
    "q": "“她听闻青山为雪白头，笑说大抵情深皆不寿”",
    "options": ["时光情书", "人间朝暮", "烟笼长安", "临安记忆"],
    "answer": "时光情书"
  },
  {
    "q": "“琼楼玉阁谁翩然清歌，尘世喧嚣忽而静默”",
    "options": ["烟火倾城", "临安记忆", "水墨江南", "清歌流觞"],
    "answer": "烟火倾城"
  },
  {
    "q": "“饮下泪中灼烫爱憎，缔结此生约盟，相随这漫漫征程”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾挑开面纱之下，化不开的冰冷，撼动这巍巍红尘”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“夕阳影照命定的相逢，如血色蔷薇盛开，缤纷”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“并肩千万里北战南征，一刀一剑，将天下平分”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以我之名愿你喧嚣罔闻，若置身怨怼彻骨冰寒加身”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾拒绝万人之上，未完整的缘分，黯然这落落浮生”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以剑之名祭你风华初成，却误许温柔错算江湖仇恩”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“天人永分留泱泱长恨，心上重门，余一寸裂痕”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“承受至深之痛之后浴火重生，是剑与人共同的信奉”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“我拼却一生用命画的押，却始终等不到你来拿”",
    "options": ["一剑轻安", "宿命", "烟笼长安", "红颜若雪"],
    "answer": "一剑轻安"
  },
  {
    "q": "“轻浅一吻如雪花落唇，梦醒后深爱已碎了心魂”",
    "options": ["红颜若雪", "江山如梦", "摆渡", "人间朝暮"],
    "answer": "红颜若雪"
  },
  {
    "q": "“天涯海角为你一骑绝尘，颠倒乾坤，血染白裳”",
    "options": ["红颜若雪", "以剑之名血薇", "乱世", "鸿蒙传说"],
    "answer": "红颜若雪"
  },
  {
    "q": "“踏破千山挥剑如神，恩怨纠缠不分”",
    "options": ["红颜若雪", "一剑轻安", "乱世", "鸿蒙传说"],
    "answer": "红颜若雪"
  },
  {
    "q": "“惊鸿照影念你情真，一曲离歌倾城”",
    "options": ["红颜若雪", "水墨江南", "临安记忆", "清歌流觞"],
    "answer": "红颜若雪"
  },
  {
    "q": "“碧海青山缱绻天地作证，风动花落看破淋漓爱恨”",
    "options": ["红颜若雪", "宿命", "摆渡", "人间朝暮"],
    "answer": "红颜若雪"
  },
  {
    "q": "“风沙湮没参商永隔的泪痕”",
    "options": ["红颜若雪", "一剑轻安", "乱世", "鸿蒙传说"],
    "answer": "红颜若雪"
  },
  {
    "q": "“她曾许日月光华千秋，目送人间逝者如川流”",
    "options": ["时光情书", "人间朝暮", "烟笼长安", "临安记忆"],
    "answer": "时光情书"
  },
  {
    "q": "“无数人盼她稍作停留，竭尽虔诚徒劳地祈求”",
    "options": ["时光情书", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "时光情书"
  },
  {
    "q": "“远渡关山赴蓬莱奉酒，不舍昼夜至大浪倾舟”",
    "options": ["时光情书", "水墨江南", "临安记忆", "清歌流觞"],
    "answer": "时光情书"
  },
  {
    "q": "“她收藏诗人生前，呕心沥血歌颂的不朽”",
    "options": ["时光情书", "宫心", "乱世", "摆渡"],
    "answer": "时光情书"
  },
  {
    "q": "“她安葬街头巷尾，众口铄金传闻的荒谬”",
    "options": ["时光情书", "风华燃尽指间砂", "一剑轻安", "乱世"],
    "answer": "时光情书"
  },
  {
    "q": "“她给予芸芸众生，一视同仁的残忍或者温柔”",
    "options": ["时光情书", "人间朝暮", "烟笼长安", "临安记忆"],
    "answer": "时光情书"
  },
  {
    "q": "“默然旁观后寂静相拥，知悉所有亦包容所有到最后”",
    "options": ["时光情书", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "时光情书"
  },
  {
    "q": "“她追溯蜉蝣逆旅，朝生暮死轮回的巡游”",
    "options": ["时光情书", "水墨江南", "临安记忆", "清歌流觞"],
    "answer": "时光情书"
  },
  {
    "q": "“她垒砌沧海桑田，白云苍狗风化的沙丘”",
    "options": ["时光情书", "宫心", "乱世", "摆渡"],
    "answer": "时光情书"
  },
  {
    "q": "“她成为繁华落幕，曲终人散流连的唯一观众”",
    "options": ["时光情书", "风华燃尽指间砂", "一剑轻安", "乱世"],
    "answer": "时光情书"
  },
  {
    "q": "“钟情于故事百年以后，最是冷清又最是怀念的风流”",
    "options": ["时光情书", "人间朝暮", "烟笼长安", "临安记忆"],
    "answer": "时光情书"
  },
  {
    "q": "“划地三尺只为你转世生辰，以剑之名寻这一世重逢”",
    "options": ["烟火倾城", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "烟火倾城"
  },
  {
    "q": "“今世的你可明了这烟火倾城，是你前世期盼的缤纷”",
    "options": ["烟火倾城", "水墨江南", "临安记忆", "清歌流觞"],
    "answer": "烟火倾城"
  },
  {
    "q": "“流年斑驳依稀前世灯火，燃我执着开出烟花千万朵”",
    "options": ["烟火倾城", "宫心", "乱世", "摆渡"],
    "answer": "烟火倾城"
  },
  {
    "q": "“看天外丛生出几种颜色，璀璨几多足将繁华比过”",
    "options": ["烟火倾城", "风华燃尽指间砂", "一剑轻安", "乱世"],
    "answer": "烟火倾城"
  },
  {
    "q": "“映入你眼中潋滟秋波，可够惊心动魄”",
    "options": ["烟火倾城", "人间朝暮", "烟笼长安", "临安记忆"],
    "answer": "烟火倾城"
  },
  {
    "q": "“江山此刻波澜壮阔，红尘灼灼如心血温热”",
    "options": ["烟火倾城", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "烟火倾城"
  },
  {
    "q": "“倾世烟火可买君一顾我，此间同乐将前世猜度”",
    "options": ["烟火倾城", "水墨江南", "临安记忆", "清歌流觞"],
    "answer": "烟火倾城"
  },
  {
    "q": "“若许匆匆尘缘纷纷落，天崩地坼窥见光阴婆娑”",
    "options": ["烟火倾城", "宫心", "乱世", "摆渡"],
    "answer": "烟火倾城"
  },
  {
    "q": "“可容我做这人间痴狂客，惊世一回赠你无上绝色”",
    "options": ["烟火倾城", "风华燃尽指间砂", "一剑轻安", "乱世"],
    "answer": "烟火倾城"
  },
  {
    "q": "“天降幕落再以流光泼墨，让四方天地万顷星河”",
    "options": ["烟火倾城", "人间朝暮", "烟笼长安", "临安记忆"],
    "answer": "烟火倾城"
  },
  {
    "q": "“也给我作衬托，碎落之前缔造传说”",
    "options": ["烟火倾城", "宿命", "一剑轻安", "红颜若雪"],
    "answer": "烟火倾城"
  },
  {
    "q": "“多年之后仍流连巷陌”",
    "options": ["烟火倾城", "水墨江南", "临安记忆", "清歌流觞"],
    "answer": "烟火倾城"
  },
  {
    "q": "“谁曾拒绝万人之上，未完整的缘分，黯然这落落浮生”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“剩下什么理由去尘封，早已背叛初衷的忠诚”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以剑之名祭你风华初成，却误许温柔错算江湖仇恩”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“天人永分留泱泱长恨，心上重门，余一寸裂痕”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“承受至深之痛之后浴火重生，是剑与人共同的信奉”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾挑开面纱之下，化不开的冰冷，撼动这巍巍红尘”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“夕阳影照命定的相逢，如血色蔷薇盛开，缤纷”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“并肩千万里北战南征，一刀一剑，将天下平分”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以我之名愿你喧嚣罔闻，若置身怨怼彻骨冰寒加身”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾拒绝万人之上，未完整的缘分，黯然这落落浮生”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“剩下什么理由去尘封，早已背叛初衷的忠诚”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以剑之名祭你风华初成，却误许温柔错算江湖仇恩”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“天人永分留泱泱长恨，心上重门，余一寸裂痕”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“承受至深之痛之后浴火重生，是剑与人共同的信奉”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾挑开面纱之下，化不开的冰冷，撼动这巍巍红尘”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“夕阳影照命定的相逢，如血色蔷薇盛开，缤纷”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“并肩千万里北战南征，一刀一剑，将天下平分”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以我之名愿你喧嚣罔闻，若置身怨怼彻骨冰寒加身”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾拒绝万人之上，未完整的缘分，黯然这落落浮生”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“剩下什么理由去尘封，早已背叛初衷的忠诚”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以剑之名祭你风华初成，却误许温柔错算江湖仇恩”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“天人永分留泱泱长恨，心上重门，余一寸裂痕”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“承受至深之痛之后浴火重生，是剑与人共同的信奉”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾挑开面纱之下，化不开的冰冷，撼动这巍巍红尘”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“夕阳影照命定的相逢，如血色蔷薇盛开，缤纷”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“并肩千万里北战南征，一刀一剑，将天下平分”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以我之名愿你喧嚣罔闻，若置身怨怼彻骨冰寒加身”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“谁曾拒绝万人之上，未完整的缘分，黯然这落落浮生”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“剩下什么理由去尘封，早已背叛初衷的忠诚”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“以剑之名祭你风华初成，却误许温柔错算江湖仇恩”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“天人永分留泱泱长恨，心上重门，余一寸裂痕”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  },
  {
    "q": "“承受至深之痛之后浴火重生，是剑与人共同的信奉”",
    "options": ["以剑之名血薇", "一剑轻安", "宿命", "风华燃尽指间砂"],
    "answer": "以剑之名血薇"
  }
];
